<?php
//练习 15:00--15:15
//1:创建3.php使用 向客户端输出1个*
echo('*');
//2:创建4.php使用 向客户端输出50个*
//$i->php 变量名叫  $i
for($i=0;$i<50;$i++){
  echo('*');
}
echo('<br />');
//3:创建5.php使用 向客户端输出5行10列*
//创建二层循环，外层循环控制行数
//              内层循环控制列数
for($i=0;$i<5;$i++){
  //循环输出 10列*
  for($j=0;$j<10;$j++){
    echo('*');
  }
  //输出 换行'<br />'
  echo('<br />');
}
//4:创建6.php使用 向客户端输出 '99乘法表'
//js  拼接字符串 i+'*'
//php 拼接字符串 $i.'*'  15:40--15:43
for($i=1;$i<=9;$i++){
	for($j=1;$j<=$i;$j++){
      echo $j.'*'.$i.'='.($i*$j);
	}
	echo('<br />');
}
?>